# GetOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..GetOptions Method
DirectShapeType Class See Also
---
Gets a copy of the current options for this DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public DirectShapeTypeOptions GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As DirectShapeTypeOptions
```

Visual C++
---
```text
public:
DirectShapeTypeOptions^ GetOptions()
```

# ### Return Value
Options currently set for this DirectShapeType.
# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace